group-reports/test-phase/results-after-queue/disk-throughput-tuning-protocol-A-sndbuf-2M/test-2.txt
write-sequentially-test-job: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=16
fio-3.7
Starting 1 process
write-sequentially-test-job: Laying out IO file (1 file / 10240MiB)

write-sequentially-test-job: (groupid=0, jobs=1): err= 0: pid=17697: Mon Jul 10 12:42:32 2023
  write: IOPS=5, BW=21.6MiB/s (22.6MB/s)(12.7GiB/602763msec)
    slat (usec): min=107, max=21277, avg=455.42, stdev=835.04
    clat (msec): min=63, max=11127, avg=2960.66, stdev=706.56
     lat (msec): min=64, max=11127, avg=2961.12, stdev=706.54
    clat percentiles (msec):
     |  1.00th=[ 2299],  5.00th=[ 2601], 10.00th=[ 2668], 20.00th=[ 2769],
     | 30.00th=[ 2769], 40.00th=[ 2802], 50.00th=[ 2802], 60.00th=[ 2802],
     | 70.00th=[ 2836], 80.00th=[ 2903], 90.00th=[ 3272], 95.00th=[ 3910],
     | 99.00th=[ 5940], 99.50th=[ 7013], 99.90th=[10805], 99.95th=[11073],
     | 99.99th=[11073]
   bw (  KiB/s): min= 7831, max=57344, per=100.00%, avg=23749.77, stdev=7133.36, samples=1116
   iops        : min=    1, max=   14, avg= 5.55, stdev= 1.81, samples=1116
  lat (msec)   : 100=0.03%, 1000=0.03%
  cpu          : usr=0.69%, sys=0.22%, ctx=3436, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=99.5%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,3254,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=21.6MiB/s (22.6MB/s), 21.6MiB/s-21.6MiB/s (22.6MB/s-22.6MB/s), io=12.7GiB (13.6GB), run=602763-602763msec

Disk stats (read/write):
    drbd1: ios=0/16310, merge=0/0, ticks=0/47245720, in_queue=47245720, util=98.80%, aggrios=0/16338, aggrmerge=0/0, aggrticks=0/15855700, aggrin_queue=15855700, aggrutil=68.71%
    dm-0: ios=0/16338, merge=0/0, ticks=0/15855700, in_queue=15855700, util=68.71%, aggrios=0/16335, aggrmerge=0/3, aggrticks=0/15847862, aggrin_queue=15839691, aggrutil=68.71%
  vdb: ios=0/16335, merge=0/3, ticks=0/15847862, in_queue=15839691, util=68.71%